package Chapter4;

public class Lesson4_3_5 {
}

/*Выберите правильный ответ
Почему рекомендуется выводить отладочную информацию при помощи класса Logger, а не через System.out или System.err?
>>>Logger поддерживает локализацию отладочных сообщений.
Logger выводит текстовые сообщения более эффективно, чем System.out и System.err.
>>>Logger позволяет менять детальность логирования, не прибегая к if'ам в коде.
>>>Logger дает возможность гибко настраивать формат и место записи сообщений без изменения программы.
Logger сообщает об ошибках с уровнем WARNING и выше виртуальной машине, чтобы она могла их обработать.*/