package Chapter7;

public class Lesson7_1_6 {
}
/*Выберите правильный ответ
Каким образом можно получить экземпляр функционального интерфейса?
>>>использовать ссылку на нестатический метод
>>>использовать ссылку на конструктор
>>>объявить анонимный класс, реализующий интерфейс, и создать экземпляр этого класса
>>>использовать лямбда-выражение
>>>использовать ссылку на статический метод
использовать ссылку на деструктор
>>>объявить именованный класс, реализующий интерфейс, и создать экземпляр этого класса*/