package Chapter7;

public class Lesson7_2_8 {
}

/*Выберите правильный ответ
Выберите верные утверждения.

Элементами стрима могут быть только объекты, стримы примитивов не разрешены.
>>>Стрим позволяет применять любое количество промежуточных операций. Все они запустятся только тогда, когда на стриме будет вызвана терминальная операция.
Стрим надо обязательно всегда закрывать, т.е. вызывать метод его close() или использовать в блоке try с ресурсами.
Применение трансформаций к элементам стрима изменяет содержимое источника, откуда стрим берет элементы (например, коллекции или массива).
>>>Стримы "одноразовые", т.е. после вызова терминальной операции стрим больше не пригоден к использованию*/
