package Java_pre_project;

public class Lesson2_2_3 {
}

/*Урок с вводом ответа
1. Как получить данные из файла .property?
2. Как запустить Спринг-приложение из-под сервера Tomcat?
3. Что такое Artifacts?
4. В чем отличие артефакта war от war exploded?
5. Какая разница между аннотациями @Component, @Repository и @Service в Spring?
6. Как выглядит структура MVC-приложения?
7. Чем контроллер отличается от сервлета?
8. Какая основная зависимость фреймворка Спринг? Почему во многих сборках она не указывается явно?
9. Как вернуть страницу в контроллере? Как вернуть данные?*/