package Java_pre_project;

public class Lesson1_1_5 {
}

/*Урок с вводом ответа
1. Что такое Maven? Для чего он нужен? Как добавлять в проект библиотеки без него?
2. Как добавить dependency в Maven? Для чего они нужны? Откуда они скачиваются?
3. Основные фазы проекта под управлением Maven?
4. Что такое JDBC? Какие классы/интерфейсы относятся к JDBC?
5. Для чего нужен DriverManager?
6. Что такое Statement, PreparedStatement, CallableStatement?
7. Что такое sql-injection?
8. Что такое ResultSet? Как с ним работать?
9. Рассказать про паттерн DAO.
10. Что такое JPA?
11. Что такое ORM?
12. Что такое Hibernate?
13. В чем разница между JPA и Hibernate? Как связаны все эти понятия?
14. Какие классы/интерфейсы относятся к JPA/Hibernate?
15. Основные аннотации Hibernate, рассказать.
16. Чем HQL отличается от SQL?
17. Что такое Query? Как передать в объект Query параметры?
18. Какие можно устанавливать параметры в hbm2ddl, рассказать про каждый из них.
19. Требования JPA к Entity-классам? Не менее пяти.
20. Жизненный цикл Entity в Hibernate? Рассказать.*/