package Chapter1;

public class Lesson1_3_6 {
}
/*Урок с вводом ответа
Скачайте игру Sokobano, написанную на Java. Ваша задача — определить имя главного класса игры.
Того, который содержит метод main и запускает игру. Введите имя этого класса ниже. Имя класса
нужно вводить без имени пакета.

К решению можно подойти двумя путями: искать по исходникам метод main или внимательно
рассмотреть команду запуска программы, зашитую в .bat/.sh файлах.

А когда справитесь с этим заданием, можете поздравить себя с окончанием первого
модуля и немного поиграть :)*/

//>>> Application
