package Chapter3;

public class Lesson3_5_4 {
}

/*Выберите правильный ответ
Выберите верные утверждения про интерфейсы и абстрактные классы.

Интерфейсы отличаются от абстрактных классов тем, что не могут содержать реализаций методов.
>>>Класс может наследоваться только от одного класса, но может реализовывать сколько угодно интерфейсов.
>>>Интерфейсы отличаются от абстрактных классов тем, что могут содержать только публичные методы и публичные статические финальные поля.
Ключевое слово "interface" — это сокращенная запись для "abstract class".*/