package Chapter3;

public class Lesson3_5_5 {
}
/*Выберите правильный ответ
Укажите необходимое и достаточное условие для того, чтобы интерфейс можно было инстанцировать при помощи лямбда-выражения.
>>>Интерфейс должен содержать ровно один абстрактный метод.
Интерфейс должен быть помечен аннотацией @FunctionalInterface.
Ровно один метод интерфейса должен быть помечен аннотацией @FunctionalInterface.
Интерфейс должен быть из стандартной библиотеки, и в JavaDoc'е к нему должна быть указана такая возможность.*/