package Chapter3;

public class Lesson3_3_8 {
}

/*Выберите правильный ответ
Выберите верные утверждения про модификатор static.
>>>К полям и методам, имеющим модификатор static, можно обращаться, не создавая экземпляр содержащего их класса.
>>>Вложенный класс, объявленный с модификатором static, теряет возможность обращаться к нестатическим членам внешнего класса.
Класс, объявленный с модификатором static, может иметь только статические методы.
Поле класса, объявленное с модификатором static, — это константа, т.е. значение не может меняться.*/