package Chapter3;

public class Lesson3_4_2 {
}

/*Выберите правильный ответ
Выберите условия, необходимые для того, чтобы метод производного класса переопределил метод базового класса.
Это сложный вопрос.
Если правильный ответ никак не находится, попробуйте экспериментально проверить все эти условия на каком-нибудь синтетическом примере.
Факт успешного переопределения метода поможет подтвердить аннотация @Override.
>>>Метод производного класса должен иметь в точности тот же набор параметров, что и метод базового класса.
Метод производного класса должен иметь в точности тот же модификатор доступа, что и метод базового класса.
Метод производного класса должен быть помечен аннотацией @Override.
>>>Метод базового класса должен быть виден в производном классе.
>>>Тип, возвращаемый методом производного класса, должен совпадать или быть подклассом типа, возвращаемого методом базового класса.
Метод производного класса должен иметь в точности тот же тип возвращаемого значения, что и метод базового класса.
>>>Метод производного класса должен иметь модификатор доступа, такой же или более открытый, чем метод базового класса.*/