package Chapter2;

public class Lesson2_2_6 {
}

/*Выберите правильный ответ
Зачем в Java, - объектно-ориентированном языке, есть примитивные типы, не являющиеся объектами,
когда есть объекты-аналоги java.lang.Integer и тп.?

Чтобы всех запутать.
Примитивные типы — пережиток ранних версий Java. Теперь их не могут убрать из-за обратной совместимости.
>>>Примитивные типы нужны для производительности вычислений. Работа с объектами намного медленнее.
Примитивные типы — это просто синонимы для соответствующих ссылочных типов.
 Т.е. int — синоним для java.lang.Integer и т.п.*/
