package Chapter6;

public class Lesson6_2_9 {
}

/*Выберите правильный ответ
Чем коллекции отличаются от массивов?
>>>Массивы встроены в язык, а коллекции — обычные классы стандартной библиотеки.
>>>Коллекции могут динамически менять размер, а размер массива фиксируется при создании.
Массивы можно использовать в цикле foreach, а коллекции нельзя.
>>>Коллекции можно сравнивать по содержимому обычным методом equals(), а для сравнения массивов используется внешний утилитный метод Arrays.equals().
>>>Коллекции могут содержать только объекты, а массивы могут содержать и примитивы.*/