package Chapter6;

public class Lesson6_1_8 {
}
/*Выберите правильный ответ
Предположим, у нас есть параметризованный класс:


public class Example<X> {
    //...
}
Что можно подставлять в качестве значения параметра X при использовании этого класса в программе?

имя любого примитивного типа (например, int)
>>>имя любого перечисления (например, DayOfWeek)
>>>значение X можно не указывать, т.е. использовать класс Example как обычный непараметризованный
>>>имя любого класса (например, Object)
значение примитивного типа (например, 42)
>>>имя любого интерфейса (например, CharSequence)
ссылку на метод (например, Object::toString)
>>>символ "?" или более сложное выражение с ключевыми словами extends и super*/