package Java0;

public class Lesson2_2_2 {
    public static void main(String[] args) {
        short varshort = 1;
        byte varbyte = 2;
        int varint = 3;
        long varlong = 4;

// 	float varfloat = 2.3;
// 	double vardouble = 2.4;

// 	boolean varboolean = false;
// 	char varchar = "N";
    }
}

/*Урок с кодом
В методе main (точка входа в программу) объявите переменные всех простых(примитивных) типов.
 Проинициализируйте их значениями отличными от значений по умолчанию.

Требования:
1. Переменные должны находиться внутри метода main
2. В методе main должны быть переменные всех простых типов
3. В методе main должны быть переменные только простых типов
4. Значения переменных должны отличаться от значений по умолчанию
5. Переменные должны иметь имя var + тип примитива без пробелов и подчеркиваний
 (например, переменная типа int должна называться varint)*/