package Java0;

public class Lesson2_3_2 {
    public static void main(String[] args) {
        //Твой код здесь
        String name = "Lida";
        System.out.println(name);
    }
}

/*Урок с кодом
В методе main (точка входа в программу) объявите строковую переменную String name
 и присвойте ей ваше имя при инициализации, после чего выведите её в консоль.

Требования:
1. Переменная должна находиться в методе main
2. Переменная должна иметь тип String
3. Переменная должна иметь имя name
4. В консоль должно быть выведено значение переменной name*/
