package Java0;

public class Lesson2_4_7 {
    public static void main(String[] args) {
        sum(4,6);
    }
    public static int sum(int x, int y) {
        //Твой код здесь
        return x + y;
    }

}

/*Урок с кодом
Создайте метод static int sum(int x, int y), который будет принимать два целочисленных параметра и возвращать их сумму.

Требования:
1. Метод должен иметь модификаторы public static
2. Метод должен принимать два целочисленных параметра
3. Метод должен возвращать целое число
4. Метод должен называться sum
5. Метод не должен ничего выводить в консоль*/
