package Java0;

public class Lesson2_4_2 {
    public static void main(String[] args) {
     printHelloWorld();
    }
    public static void printHelloWorld() {
        //Твой код здесь
        System.out.println("Hello world!");
    }
}


/*Урок с кодом
Создайте метод public static void printHelloWorld(), который будет выводить в консоль строку “Hello world!”.

Требования:
1. Метод должен иметь модификатор static
2. Метод не должен принимать параметры
3. Метод должен выводить в консоль строку “Hello world!”
4. Метод не должен ничего возвращать*/