package Chapter5;

public class Lesson5_1_5 {
}
/*Выберите правильный ответ
Какая базовая директория используется для превращения относительного пути к файлу или директории на диске в абсолютный путь?

Речь о методах:


File.getAbsolutePath();
File.getAbsoluteFile();
Path.toAbsolutePath();
Директория, где установлен JDK.
Корневая директория файловой системы (C:\ — под Windows, / — под Unix)
Директория, где находится JAR, из которого запущена программа.
>>>Текущая директория Java-процесса, т.е. в какой директории введена команда*/