package Chapter5;

public class Lesson5_4_4 {
}

/*Выберите правильный ответ
В чем разница между классами ввода-вывода, лежащими в пакетах java.io (такими как InputStream, OutputStream, Reader, Writer) и java.nio (такими как Channel, ByteBuffer)? Можно выбрать несколько вариантов.
Классы java.nio являются устаревшими, рекомендуется использовать java.io.
>>>Классы java.nio поддерживают неблокирующий ввод-вывод, а java.io — блокирующий.
Классы java.io предоставляют более низкоуровневый интерфейс, пользуясь которым можно писать более эффективные и масштабируемые программы.
Классы java.io бросают java.io.IOException, классы java.nio бросают java.nio.NIOException.
>>>Классы java.nio предоставляют более низкоуровневый интерфейс, пользуясь которым можно писать более эффективные и масштабируемые программы.
Классы java.io являются устаревшими, рекомендуется использовать java.nio.
Классы java.io поддерживают неблокирующий ввод-вывод, а java.nio — блокирующий.*/