package Chapter5;

public class Lesson5_1_7 {
}
/*Выберите правильный ответ
В чем отличия java.io.File и java.nio.file.Path?
Path — это класс, File — это интерфейс.
>>>Методы работы с ФС через объект Path при ошибках ввода-вывода бросают исключения; методы работы с File при ошибках возвращают false.
Методы работы с ФС через объект File при ошибках ввода-вывода бросают исключения; методы работы с Path при ошибках возвращают false.
>>>Path допускает работу с файлами на виртуальных файловых системах, а File нет.
>>>File — это старый способ доступа к файловой системе, Path — это новый рекомендуемый способ.
>>>File — это класс, Path — это интерфейс.
File допускает работу с файлами на виртуальных файловых системах, а Path нет.
Path — это устаревший способ доступа к файловой системе, File — это новый рекомендуемый способ.*/